{"title":"The Game of Milk Caps","excerpt":"Pogs are popular where I come from. You can collect them, share them with your friends, or compete in a battle to win over more pogs.","slug":"pogs","image":"data:image/gif;base64,R0lGODlhAQABAIAAAP///wAAACH5BAEAAAAALAAAAAABAAEAAAICRAEAOw==","status":"published","body":{"time":1580941827498,"blocks":[{"type":"paragraph","data":{"text":"Pogs were popular back in my day. They were these circular cardboard pieces with awesome designs and logos on them."}},{"type":"image","data":{"file":{"url":"/images/pogs.jpg"},"caption":"","withBorder":false,"stretched":false,"withBackground":false}},{"type":"paragraph","data":{"text":"There were many things you could do with pogs. You could collect them, admire them, trade amongst friends, or play them against each other."}},{"type":"paragraph","data":{"text":"Here’s how you’d play. Typically there are 2 players and you each stack a few pogs on top of each other. You then take turns trying to flip over the pogs using a Slammer, a circular medal pog (which were also very cool)."}},{"type":"image","data":{"file":{"url":"/images/slammers.jpg"},"caption":"","withBorder":false,"stretched":false,"withBackground":false}},{"type":"paragraph","data":{"text":"The rules were simple, the pogs you flipped over were yours for the taking. Flip them all over in the first try you win, only flip over 1, that one is yours and then it’s the other persons turn."}},{"type":"paragraph","data":{"text":"There were all different strategies on the best way to flip pogs, you could slam it down on the flat surface or you could jack knife it. Some kids had a natual knack for flipping over pogs while others were left being sad with a smaller pog collection."}},{"type":"paragraph","data":{"text":"In a way it was kind of like gambling for kids. You could choose to go all in with some of your favorite pogs and you would either leave victorious or leave empty handed."}},{"type":"quote","data":{"text":"It is better to fight and fall than to live without Pogs","caption":"","alignment":"left"}},{"type":"paragraph","data":{"text":"Pogs have an interesting origin story. Pogs started off as milk caps for a short time. Later these circular cardboard pieces were used on caps of Juice, one popular juice was the Passion fruit, Orange, and Guava juice (POG). Kids would collect these and started playing the game we know today as Pogs. Pretty cool, right?"}}],"version":"2.16.1"},"meta":{"title":"The Game of Milk Caps","description":"Pogs are popular where I come from. You can collect them, share them with your friends, or compete in a battle to win over more pogs.","schema":"","data":""},"created_at":"2020-02-05 14:30:27","updated_at":"2020-02-05 14:30:27"}